АлогистикТест2/src/Documents/алк_ВходящийТранспорт/алк_ВходящийТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВходящийТранспорт</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиНесортированного</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВагона</name>
    <comment>Номер вагона/автомобиля</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <comment>Номер ЖД накладной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВагонаВРег</name>
    <comment>Номер вагона/автомобиля</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладнойВрег</name>
    <comment>Номер ЖД накладной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РазгрузкаСобственнымиСилами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеНастройки/алк_ДополнительныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеНастройки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Строка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_ВходящийТранспорт/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.СтруктурнаяЕдиница = ПолучитьСкладНесортированного();		
	УстановитьУсловноеОформление();
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСкладНесортированного()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ДополнительныеНастройкиСрезПоследних.Строка
		|ИЗ
		|	РегистрСведений.алк_ДополнительныеНастройки.СрезПоследних КАК алк_ДополнительныеНастройкиСрезПоследних
		|ГДЕ
		|	алк_ДополнительныеНастройкиСрезПоследних.Параметр = &Параметр";
	
	Запрос.УстановитьПараметр("Параметр", "КодСкладаНесортированного");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КодСклада = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КодСклада = ВыборкаДетальныеЗаписи.Строка;		
	КонецЦикла;
	
	Возврат Справочники.СтруктурныеЕдиницы.НайтиПоКоду(КодСклада);
	

КонецФункции // ПолучитьСкладНесортированного()


&НаКлиенте
Процедура РазгруженПриИзменении(Элемент)
	Объект.ДатаРазгрузки = ТекущаяДата();
	УстановитьУсловноеОформление();
КонецПроцедуры

Процедура УстановитьУсловноеОформление()
	Элементы.ГрТранспорт.Видимость = Объект.Разгружен;
КонецПроцедуры
